
전공필수
데이터베이스
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공필수
멀티미디어개론
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공필수
멀티미디어통신
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공필수
이산수학
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공필수
컴퓨터개론
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
가상현실
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
게임마케팅
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
게임영상연출
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
디지털콘텐츠와저작권
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
멀티미디어설계
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
멀티미디어시스템
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
멀티미디어특강
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
문화기술론
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
미디어인터랙션디자인
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
소프트웨어공학
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
시스템분석설계
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
영상정보처리
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
인간과컴퓨터상호작용
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
인터넷마케팅
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
자료구조
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
전산영어
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관


전공선택
컴퓨터네트워크
학점 : 3강의시간 : 3실습시간 : 0
교수
요목 개설교육
훈련기관